# 5장 데이터 사전 처리

## 1 누락 데이터 처리
- 머신러닝 등 데이터 분석의 정확도는 분석 데이터의 품질에 의해 좌우 됨.
- 누락, 중복 데이터 수정 변형
- 머신러닝 분석 모형에 데이터 입력하기 전에 적절한 값으로 대체하는 과정 필요.

### 누락 데이터 확인

In [6]:
# 라이브러리 불러오기
import seaborn as sns

df = sns.load_dataset('titanic')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

- embarked = embark_town -> 2개의 null값 : 2개를 지울것인가..?
- deck 삭제

In [7]:
# deck 열의 NaN 개수 확인하기
nan_deck = df['deck'].value_counts()
nan_deck

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [10]:
nan_deck = df['deck'].value_counts(dropna = False) # dropna = False로 NaN값의 갯수도 세어줌

In [11]:
nan_deck

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [12]:
# isnull() : 누락 데이터면 True를 반환하고, 유효한 데이터가 존재하면 False를 반환한다.
# notnull() : 유효한 데이터가 존재하면 True, 누락 데이터면 False를 반환한다.

df.isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [14]:
df.notnull() # isnull()과 반대

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
887,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
888,True,True,True,False,True,True,True,True,True,True,True,False,True,True,True
889,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
890,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True

In [16]:
# isnull() 메서드로 누락 데이터 갯수 구하기
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [17]:
# NaN 값이 500개 이상인 열을 모두 삭제 - deck 열 (891개 중 688개의 NaN 값)
df_thresh = df.dropna(axis = 1, thresh = 500)
df_thresh.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
embark_town      2
alive            0
alone            0
dtype: int64

In [21]:
# age열에 나이 데이터가 없는 모든 행을 삭제
# how = 'any' NaN 값이 하나라도 있으면 모두 삭제
df_age = df.dropna(subset = ['age'], how = 'any', axis =0)
df_age.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     714 non-null    int64
 1   pclass       714 non-null    int64
 2   sex          714 non-null    object
 3   age          714 non-null    float64
 4   sibsp        714 non-null    int64
 5   parch        714 non-null    int64
 6   fare         714 non-null    float64
 7   embarked     712 non-null    object
 8   class        714 non-null    category
 9   who          714 non-null    object
 10  adult_male   714 non-null    bool
 11  deck         184 non-null    category
 12  embark_town  712 non-null    object
 13  alive        714 non-null    object
 14  alone        714 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 70.2+ KB

In [22]:
df['age'].head(6)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
Name: age, dtype: float64

In [25]:
mean_age = df['age'].mean()
df['age'].fillna(mean_age, inplace = True) # df.fillna와 구분 df['age'].fillna
df['age'].head(6)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
Name: age, dtype: float64

In [26]:
df['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [28]:
df['embark_town'].value_counts(dropna = True)

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [29]:
df['embark_town'].value_counts(dropna = True).idxmax()

'Southampton'

In [30]:
most_freq = df['embark_town'].value_counts(dropna = True).idxmax()
most_freq

'Southampton'

In [32]:
df.pivot_table(index = ['embark_town'], aggfunc = 'size')

embark_town
Cherbourg      168
Queenstown      77
Southampton    644
dtype: int64

In [35]:
df['embark_town'].fillna(most_freq, inplace = True)

In [38]:
df['embark_town'][825:830] # NaN값이 최고 많이 나온 Southampton으로 변경

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [42]:
df = sns.load_dataset('titanic')

In [40]:
df['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [41]:
df['embark_town'].fillna(method = 'ffill', inplace = True)
df['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object

In [43]:
df['embark_town'].fillna(method = 'bfill', inplace = True)
df['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829      Cherbourg
Name: embark_town, dtype: object

### 누락 데이터가 NaN으로 표시되지 않은 경우
- df.replace('?', np.nan, inplace = True) ex) '?' 를 NaN값으로

## 2 중복 데이터 처리
- 동일한 대상이 중복으로 존재한다면 분석 겨로가를 왜곡할 가능성이 있음

In [45]:
import pandas as pd
df1 = pd.DataFrame({'c1' : ['a', 'a', 'b', 'a', 'b'],
                   'c2' : [1, 1, 1, 2, 2],
                   'c3' : [1, 1, 2, 2, 2]})
df1

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [47]:
df_dup = df1.duplicated() # 중복이 나올경우 True반환
df_dup

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [48]:
df1['c2']

0    1
1    1
2    1
3    2
4    2
Name: c2, dtype: int64

In [50]:
col_dup = df1['c2'].duplicated() # 열단위로도 가능
col_dup

0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool

### 중복데이터 제거

In [53]:
df2 = df1.drop_duplicates()
df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [56]:
# c2, c3열을 기준으로 중복 행을 제거
df3 = df1.drop_duplicates(['c2', 'c3'])

In [55]:
df3

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

## 데이터 표준화
- 실무에서 접하는 데이터셋은 다양한 사람들의 손을 거쳐 만들어짐.
- 다양한 형태로 변형
- 동일한 대상을 표현하는 방법에 차이가 있으면, 분석의 정확도가 떨어짐

### 3-1 단위 환산
- 같은 데이터셋 안에 서로 다른 측정 단위를 측정한다면, 전체 데이터의 일관성 측면에서 문제가 발생함. 따라서 측정 단위를 동일하게 통일해야 함.

In [91]:
df = pd.read_csv("C:/sample_data/auto-mpg.csv", header = None)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       398 non-null    float64
 1   1       398 non-null    int64
 2   2       398 non-null    float64
 3   3       398 non-null    object
 4   4       398 non-null    float64
 5   5       398 non-null    float64
 6   6       398 non-null    int64
 7   7       398 non-null    int64
 8   8       398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [74]:
df.columns = ['mpg','cylinders', 'displacement', 'horespower', 'weight',
             'acceleration', 'model year', 'origin', 'name']
df.head(3)

,mpg,cylinders,displacement,horespower,weight,acceleration,model year,origin,name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite

In [75]:
mpg_to_kpl = 1.60934 / 3.78541 # kpl = killometer per liter
df['kpl'] = df['mpg'] * mpg_to_kpl # mpg를 kpㅣ단위로 바꿔줌
df['kpl'] = df['kpl'].round(2) # 소수점 아래 2번째 자리까지 표기

df.head()

,mpg,cylinders,displacement,horespower,weight,acceleration,model year,origin,name,kpl
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,7.65
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,6.38
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,7.65
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst,6.80
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino,7.23

### 3-2 자료형 변환
- 숫자가 문자열로 저장된 경우 숫자형으로 변환해야함
- dtypes 속성을 활용하여 데이터 프레임을 구성하는 각 열의 자료형을 확인

In [93]:
import numpy as np
df_auto.columns = ['mpg','cylinders', 'displacement', 'horsepower', 'weight', 
              'acceleration', 'model year', 'origin', 'name']

df_auto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    float64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [94]:
df_auto['horsepower'].replace('?', np.nan, inplace = True)
df_auto['horsepower'].unique()

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', nan, '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [97]:
df_auto.dropna(subset = ['horsepower'], inplace = True) # 누락 데이터 행을 삭제

In [98]:
df_auto['horsepower'].unique()

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [99]:
df_auto['horsepower'] = df_auto['horsepower'].astype('float')
df_auto['horsepower'].unique()

array([130., 165., 150., 140., 198., 220., 215., 225., 190., 170., 160.,
        95.,  97.,  85.,  88.,  46.,  87.,  90., 113., 200., 210., 193.,
       100., 105., 175., 153., 180., 110.,  72.,  86.,  70.,  76.,  65.,
        69.,  60.,  80.,  54., 208., 155., 112.,  92., 145., 137., 158.,
       167.,  94., 107., 230.,  49.,  75.,  91., 122.,  67.,  83.,  78.,
        52.,  61.,  93., 148., 129.,  96.,  71.,  98., 115.,  53.,  81.,
        79., 120., 152., 102., 108.,  68.,  58., 149.,  89.,  63.,  48.,
        66., 139., 103., 125., 133., 138., 135., 142.,  77.,  62., 132.,
        84.,  64.,  74., 116.,  82.])

In [100]:
df_auto['origin'].replace({1:'USA', 2:'EU', 3:'JAPAN'}, inplace = True)
df_auto.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name
0,18.0,8,307.0,130.0,3504.0,12.0,70,USA,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,USA,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,USA,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,USA,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,USA,ford torino

In [101]:
df_auto.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    int64
 7   origin        392 non-null    object
 8   name          392 non-null    object
dtypes: float64(5), int64(2), object(2)
memory usage: 30.6+ KB

In [102]:
df_auto['origin'].unique()

array(['USA', 'JAPAN', 'EU'], dtype=object)

In [103]:
df_auto['origin'] = df_auto['origin'].astype('category')
df_auto.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    int64
 7   origin        392 non-null    category
 8   name          392 non-null    object
dtypes: category(1), float64(5), int64(2), object(1)
memory usage: 28.1+ KB

In [104]:
df_auto['model year'] = df_auto['model year'].astype('category')

## 범주형 데이터 처리

### 4-1 구간 분할
- 데이터 분석 알고리즘에 따라서는 연속 데이터를 일정한 구간으로 나눠서 분석
- 구간 분할은 경계값을 기준으로 나누어줌

In [108]:
describe_dic = df_auto['horsepower'].describe() # 데이터 요약
describe_dic

count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: horsepower, dtype: float64

In [110]:
describe_dic.loc['min']

46.0

In [111]:
bin_dividers = [describe_dic.loc['min'], describe_dic.loc['50%'],
                describe_dic.loc['75%'], describe_dic.loc['max']]

bin_dividers

[46.0, 93.5, 126.0, 230.0]

In [113]:
# 3개의 bin에 이름 출력
bin_names = ['저출력', '보통출력', '고출력']

In [117]:
df_auto['hp_bin'] = pd.cut(x = df_auto['horsepower'], # 데이터 배열
                          bins = bin_dividers, # 경계값 리스트
                          labels = bin_names, # bin 이름
                          include_lowest = True) # 첫 경계값 포함

In [116]:
df_auto.head(30)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name,hp_bin
0,18.0,8,307.0,130.0,3504.0,12.0,70,USA,chevrolet chevelle malibu,고출력
1,15.0,8,350.0,165.0,3693.0,11.5,70,USA,buick skylark 320,고출력
2,18.0,8,318.0,150.0,3436.0,11.0,70,USA,plymouth satellite,고출력
3,16.0,8,304.0,150.0,3433.0,12.0,70,USA,amc rebel sst,고출력
4,17.0,8,302.0,140.0,3449.0,10.5,70,USA,ford torino,고출력
5,15.0,8,429.0,198.0,4341.0,10.0,70,USA,ford galaxie 500,고출력
6,14.0,8,454.0,220.0,4354.0,9.0,70,USA,chevrolet impala,고출력
7,14.0,8,440.0,215.0,4312.0,8.5,70,USA,plymouth fury iii,고출력
8,14.0,8,455.0,225.0,4425.0,10.0,70,USA,pontiac catalina,고출력
9,15.0,8,390.0,190.0,3850.0,8.5,70,USA,amc ambassador dpl,고출력
10,15.0,8,383.0,170.0,3563.0,10.0,70,USA,dodge challenger se,고출력
11,14.0,8,340.0,160.0,3609.0,8.0,70,USA,plymouth 'cuda 340,고출력
12,15.0,8,400.0,150.0,3761.0,9.5,70,USA,chevrolet monte carlo,고출력
13,14.0,8,455.0,225.0,3086.0,10.0,70,USA,buick estate wagon (sw),고출력
14,24.0,4,113.0,95.0,2372.0,15.0,70,JAPAN,toyota corona mark ii,보통출력
15,22.0,6,198.0,95.0,2833.0,15.5,70,USA,plymouth duster,보통출력
16,18.0,6,199.0,97.0,2774.0,15.5,70,USA,amc hornet,보통출력
17,21.0,6,200.0,85.0,2587.0,16.0,70,USA,ford maverick,저출력
18,27.0,4,97.0,88.0,2130.0,14.5,70,JAPAN,datsun pl510,저출력
19,26.0,4,97.0,46.0,1835.0,20.5,70,EU,volkswagen 1131 deluxe sedan,저출력
20,25.0,4,110.0,87.0,2672.0,17.5,70,EU,peugeot 504,저출력
21,24.0,4,107.0,90.0,2430.0,14.5,70,EU,audi 100 ls,저출력
22,25.0,4,104.0,95.0,2375.0,17.5,70,EU,saab 99e,보통출력
23,26.0,4,121.0,113.0,2234.0,12.5,70,EU,bmw 2002,보통출력
24,21.0,6,199.0,90.0,2648.0,15.0,70,USA,amc gremlin,저출력
25,10.0,8,360.0,215.0,4615.0,14.0,70,USA,ford f250,고출력
26,10.0,8,307.0,200.0,4376.0,15.0,70,USA,chevy c20,고출력
27,11.0,8,318.0,210.0,4382.0,13.5,70,USA,dodge d200,고출력
28,9.0,8,304.0,193.0,4732.0,18.5,70,USA,hi 1200d,고출력
29,27.0,4,97.0,88.0,2130.0,14.5,71,JAPAN,datsun pl510,저출력

## 4-2 더미 변수
- 범주형 데이터가 2개 이상일 경우 머신러닝 알고리즘에서는 범주형 데이터이기 보다 연속형 데이터로 연산, 0과 1인 2개의 값으로 변경해야 함

In [120]:
# 원-핫 인코딩
# 출력 등급 열의 범주형 데이터를 더미 변수로 변환
horsepower_dummies = pd.get_dummies(df_auto['hp_bin'])
horsepower_dummies.head(30)

    저출력  보통출력  고출력
0     0     0    1
1     0     0    1
2     0     0    1
3     0     0    1
4     0     0    1
5     0     0    1
6     0     0    1
7     0     0    1
8     0     0    1
9     0     0    1
10    0     0    1
11    0     0    1
12    0     0    1
13    0     0    1
14    0     1    0
15    0     1    0
16    0     1    0
17    1     0    0
18    1     0    0
19    1     0    0
20    1     0    0
21    1     0    0
22    0     1    0
23    0     1    0
24    1     0    0
25    0     0    1
26    0     0    1
27    0     0    1
28    0     0    1
29    1     0    0

In [122]:
from sklearn import preprocessing

label_encoder = preprocessing.LabelEncoder() # 한글로 되어있는 라벨을 숫자값으로
onehot_encoder = preprocessing.OneHotEncoder() # 0과 1의 숫자로 만들어줌

In [124]:
df_auto['hp_bin'].head(30)

0      고출력
1      고출력
2      고출력
3      고출력
4      고출력
5      고출력
6      고출력
7      고출력
8      고출력
9      고출력
10     고출력
11     고출력
12     고출력
13     고출력
14    보통출력
15    보통출력
16    보통출력
17     저출력
18     저출력
19     저출력
20     저출력
21     저출력
22    보통출력
23    보통출력
24     저출력
25     고출력
26     고출력
27     고출력
28     고출력
29     저출력
Name: hp_bin, dtype: category
Categories (3, object): ['저출력' < '보통출력' < '고출력']

In [126]:
onehot_labeled = label_encoder.fit_transform(df_auto['hp_bin'].head(30))
onehot_labeled

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 2, 2, 2, 2, 2,
       1, 1, 2, 0, 0, 0, 0, 2])

In [128]:
onehot_reshaped = onehot_labeled.reshape(len(onehot_labeled), 1)
onehot_reshaped

array([[0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [1],
       [1],
       [1],
       [2],
       [2],
       [2],
       [2],
       [2],
       [1],
       [1],
       [2],
       [0],
       [0],
       [0],
       [0],
       [2]])

In [132]:
onehot_fitted = onehot_encoder.fit_transform(onehot_reshaped)
print(onehot_fitted) # 1이 들어간 위치만 보여줌

  (0, 0)	1.0
  (1, 0)	1.0
  (2, 0)	1.0
  (3, 0)	1.0
  (4, 0)	1.0
  (5, 0)	1.0
  (6, 0)	1.0
  (7, 0)	1.0
  (8, 0)	1.0
  (9, 0)	1.0
  (10, 0)	1.0
  (11, 0)	1.0
  (12, 0)	1.0
  (13, 0)	1.0
  (14, 1)	1.0
  (15, 1)	1.0
  (16, 1)	1.0
  (17, 2)	1.0
  (18, 2)	1.0
  (19, 2)	1.0
  (20, 2)	1.0
  (21, 2)	1.0
  (22, 1)	1.0
  (23, 1)	1.0
  (24, 2)	1.0
  (25, 0)	1.0
  (26, 0)	1.0
  (27, 0)	1.0
  (28, 0)	1.0
  (29, 2)	1.0

## 5 정규화
- 각 변수에 들어있는 숫자 데이터의 크기차이 때문에 머신러닝 분석결과가 달라질 수 있음
- 동일한 크기 기준으로 나눈 비율로 나타내는 것을 정규화라 함

In [143]:
df_auto = pd.read_csv("C:/sample_data/auto-mpg.csv", header = None)
df_auto.columns = ['mpg', 'cylinders', 'displacement', 'horsepower', 'weight', 
              'acceleration', 'model year', 'origin', 'name']
df_auto.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

In [144]:
df_auto['horsepower'].replace('?', np.nan, inplace = True)
df_auto.dropna(subset = ['horsepower'], axis = 0, inplace = True)
df_auto['horsepower'] = df_auto['horsepower'].astype('float')
df_auto.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    int64
 7   origin        392 non-null    int64
 8   name          392 non-null    object
dtypes: float64(5), int64(3), object(1)
memory usage: 30.6+ KB

In [145]:
min_x = df_auto['horsepower'] - df_auto['horsepower'].min()
min_x

0       84.0
1      119.0
2      104.0
3      104.0
4       94.0
       ...
393     40.0
394      6.0
395     38.0
396     33.0
397     36.0
Name: horsepower, Length: 392, dtype: float64

In [146]:
min_max = df_auto['horsepower'].max() - df_auto['horsepower'].min()
min_max

184.0

In [148]:
df_auto['horsepower'] = min_x / min_max
df_auto['horsepower'] # 0 과 1 사이의 값을 가짐

0      0.456522
1      0.646739
2      0.565217
3      0.565217
4      0.510870
         ...
393    0.217391
394    0.032609
395    0.206522
396    0.179348
397    0.195652
Name: horsepower, Length: 392, dtype: float64

## 6 시계열 데이터
- 주식, 환율 등 금융 데이터를 다루기 위해 개발
- 시계열 데이터를 데이터 프레임의 행 인덱스로 사용하면, 시간으로 기록된 데이터를 분석하는 것이 편리
- 판다스의 시간 표시 방식은 Timestamp와 Period가 있음.

### 6-1 다른 자료형을 시계열 객체로 변환
- 데이터에서 시간은 별도의 시간 자료형이 아닌 문자열, 숫자로 저장
- 다른 자료형으로 저장된 시간 데이터를 판다스 시계열 객체인 Timestamp로 변환하는 함수를 제공

In [149]:
df_stock = pd.read_csv('C:/sample_data/stock-data.csv')
df_stock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [150]:
df_stock.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [153]:
df_stock['new_Date'] = pd.to_datetime(df_stock['Date'])
# Date는 문자
# new_date는 datetime

In [154]:
df_stock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   new_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [155]:
df_stock.set_index('new_Date', inplace = True)

In [156]:
del df_stock['Date']

In [157]:
df_stock.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 20 entries, 2018-07-02 to 2018-06-01
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Close   20 non-null     int64
 1   Start   20 non-null     int64
 2   High    20 non-null     int64
 3   Low     20 non-null     int64
 4   Volume  20 non-null     int64
dtypes: int64(5)
memory usage: 960.0 bytes

In [158]:
df_stock

            Close  Start   High    Low  Volume
new_Date
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2018-06-26  10800  10900  11000  10700   63039
2018-06-25  11150  11400  11450  11000   55519
2018-06-22  11300  11250  11450  10750  134805
2018-06-21  11200  11350  11750  11200  133002
2018-06-20  11550  11200  11600  10900  308596
2018-06-19  11300  11850  11950  11300  180656
2018-06-18  12000  13400  13400  12000  309787
2018-06-15  13400  13600  13600  12900  201376
2018-06-14  13450  13200  13700  13150  347451
2018-06-12  13200  12200  13300  12050  558148
2018-06-11  11950  12000  12250  11950   62293
2018-06-08  11950  11950  12200  11800   59258
2018-06-07  11950  12200  12300  11900   49088
2018-06-05  12150  11800  12250  11800   42485
2018-06-04  11900  11900  12200  11700   25171
2018-06-01  11900  11800  12100  11750   32062

### Timestamp를 Period로 변환
- 판다스 to_period() 함수를 이용하면 일정한 기간을 나타내는 Period 객체로 Timestamp객체를 변환할 수 있음
- freq 옵션에 기준이 되는 기간을 설정

In [159]:
dates = ['2019-01-01', '2020-03-01', '2021-06-01']

ts_dates = pd.to_datetime(dates)
ts_dates

DatetimeIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='datetime64[ns]', freq=None)

In [160]:
# 날짜기준
ts_dates.to_period(freq = 'D')

PeriodIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='period[D]')

In [161]:
# 월 기준
ts_dates.to_period(freq = 'M')

PeriodIndex(['2019-01', '2020-03', '2021-06'], dtype='period[M]')

In [162]:
# 년 기준
ts_dates.to_period(freq = 'Y')

PeriodIndex(['2019', '2020', '2021'], dtype='period[A-DEC]')

### 6-2 시계열 데이터 만들기

#### Timestamp 배열
- 판다스 data_range()함수로 여러개의 날짜가 들어있는 배열 형태의 시계열 데이터를 만들 수 있음
- range() 함수로 숫자 배열을 만드는 것과 유사

In [165]:
ts_ms = pd.date_range(start = '2019-01-01',
                     end = None, 
                     periods = 6, 
                     freq = 'MS', # 시간 간격
                     tz = 'Asia/Seoul') # 시간대 (Timezone)
ts_ms

DatetimeIndex(['2019-01-01 00:00:00+09:00', '2019-02-01 00:00:00+09:00',
               '2019-03-01 00:00:00+09:00', '2019-04-01 00:00:00+09:00',
               '2019-05-01 00:00:00+09:00', '2019-06-01 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='MS')

In [173]:
ts_ms = pd.date_range(start = '2019-01-01',
                     end = None, 
                     periods = 6, 
                     freq = 'M', # 시간 간격
                     tz = 'Asia/Seoul') # 시간대 (Timezone)
ts_ms

DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-02-28 00:00:00+09:00',
               '2019-03-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-05-31 00:00:00+09:00', '2019-06-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='M')

In [169]:
ts_ms = pd.date_range(start = '2019-01-01',
                     end = None, 
                     periods = 6, 
                     freq = '3M', # 시간 간격 (3M ; 3개월)
                     tz = 'Asia/Seoul') # 시간대 (Timezone)
ts_ms

DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-07-31 00:00:00+09:00', '2019-10-31 00:00:00+09:00',
               '2020-01-31 00:00:00+09:00', '2020-04-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='3M')

In [176]:
pr_m = pd.period_range(start = '2019-01-01',
                      end = None,
                      periods = 3,
                      freq = 'M')
pr_m # 1월 전체, 2월 전체, 3월 전체

PeriodIndex(['2019-01', '2019-02', '2019-03'], dtype='period[M]')

In [177]:
pr_h = pd.period_range(start = '2019-01-01',
                      end = None,
                      periods = 3,
                      freq = 'H')
pr_h

PeriodIndex(['2019-01-01 00:00', '2019-01-01 01:00', '2019-01-01 02:00'], dtype='period[H]')

In [178]:
pr_2h = pd.period_range(start = '2019-01-01',
                      end = None,
                      periods = 3,
                      freq = '2H')
pr_2h

PeriodIndex(['2019-01-01 00:00', '2019-01-01 02:00', '2019-01-01 04:00'], dtype='period[2H]')

### 6-3 시계열 데이터의 활용
- 날짜데이터 분리
- 연-월-일 날짜 데이터에서 일부를 분리하여 추출할 수 있음

In [179]:
df_stock.reset_index(inplace = True)

In [180]:
df_stock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   new_Date  20 non-null     datetime64[ns]
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
dtypes: datetime64[ns](1), int64(5)
memory usage: 1.1 KB

In [181]:
df_stock['Year'] = df_stock['new_Date'].dt.year
df_stock['Month'] = df_stock['new_Date'].dt.month
df_stock['Day'] = df_stock['new_Date'].dt.day
df_stock.head()

    new_Date  Close  Start   High    Low  Volume  Year  Month  Day
0 2018-07-02  10100  10850  10900  10000  137977  2018      7    2
1 2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2 2018-06-28  10400  10900  10950  10150  155769  2018      6   28
3 2018-06-27  10900  10800  11050  10500  133548  2018      6   27
4 2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [182]:
df_stock['Date_yr'] = df_stock['new_Date'].dt.to_period(freq = 'Y')
df_stock['Date_m'] = df_stock['new_Date'].dt.to_period(freq = 'M')
df_stock.head()

,new_Date,Close,Start,High,Low,Volume,Year,Month,Day,Date_yr,Date_m
0,2018-07-02,10100,10850,10900,10000,137977,2018,7,2,2018,2018-07
1,2018-06-29,10700,10550,10900,9990,170253,2018,6,29,2018,2018-06
2,2018-06-28,10400,10900,10950,10150,155769,2018,6,28,2018,2018-06
3,2018-06-27,10900,10800,11050,10500,133548,2018,6,27,2018,2018-06
4,2018-06-26,10800,10900,11000,10700,63039,2018,6,26,2018,2018-06

In [ ]:
df_stock.set_index('new_Date')